modules/models/Admin.php

UPDATE `admin` SET `logintime`=1534232536 WHERE adminuser = 'admin'
---
    public function login($data){
        if ($this->load($data) && $this->validate()){
            $lifetime = $this->rememberMe ? 24*3600 : 0;
            $session = \Yii::$app->session;
            session_set_cookie_params($lifetime);
            $session['admin'] = [
                'adminuser'=>$this->adminuser,
                'isLogin'=>1
            ];

            $this->updateAll(['logintime'=>time()],'adminuser = :user',[':user'=>$this->adminuser]);