modules/controllers/BaseController.php

    public function getRolePrivilege($uid = 0){
        if( !$uid && $this->current_user ){
            $uid = $this->current_user->id;
        }

        if( !$this->privilege_urls ){
            $role_ids = UserRole::find()->where([ 'uid' => $uid ])->select('role_id')->asArray()->column();
---
SELECT `role_id` FROM `user_role` WHERE `uid`=0