modules/controllers/UserController.php

SELECT COUNT(*) FROM `admin` WHERE `status`=1
SELECT * FROM `admin` WHERE `status`=1 LIMIT 10
---
    public function actionUsers(){
        $this->layout='layout1';
        $model = Admin::find()->where(['status'=>1]);
        $count = $model->count();
        $pageSize = \Yii::$app->params['pageSize']['admin'];
        $pager = new Pagination(['totalCount'=>$count,'pageSize'=>$pageSize]);
        $users = $model->offset($pager->offset)->limit($pager->limit)->all();